//! $Id: clipboard.js 2020.04.06 Tpb.Tools $
// ++++++++++++++++++++++++++++++++++++++++
// 	Project: Tpb v0.4.0
//  E-Mail:  zhliner@gmail.com
// 	Copyright (c) 2019 - 2020 铁皮工作室  MIT License
//
//////////////////////////////////////////////////////////////////////////////
//
//  剪贴板操作封装。
//
//  支持操作：
//      - copy
//      - cut
//      - paste
//
///////////////////////////////////////////////////////////////////////////////
//

const
    $ = window.$,

    __textElem


const ClipBoard = {

    copy() {
        //
    }

};