//! $Id: config.js 2020.04.05 $
// +++++++++++++++++++++++++++++++++++++++++++++++
//  Project: Articlejs v0.1.0
//  E-Mail:  zhliner@gmail.com
//  Copyright (c) 2020 - 2020 铁皮工作室  MIT License
//
//////////////////////////////////////////////////////////////////////////////
//
//  用户配置定义。
//
//  安装根路径（URL）和模板根目录配置文件：base/tpb/config.js。
//
//
///////////////////////////////////////////////////////////////////////////////
//


const Setup = {

    // 元素选取态类名。
    selectedClass:  '_selected',

};


const Local = {

    // 目标名。
    tocLabel:   "【目 录】",

};


// 导出。
//////////////////////////////////////////////////////////////////////////////

export {
    Setup,
    Local,
}
