//! $Id: cells/base.js 2020.04.24 Articlejs.Libs $
// +++++++++++++++++++++++++++++++++++++++++++++++++
// 	Project: Articlejs v0.1.0
//  E-Mail:  zhliner@gmail.com
// 	Copyright (c) 2020 - 2020 铁皮工作室  MIT License
//
//////////////////////////////////////////////////////////////////////////////
//
//	内容单元基类实现。
//
//
///////////////////////////////////////////////////////////////////////////////
//


//
// 行块单元基类。
// 注：仅供继承。
//
class BlockCell {

    constructor() {
        //
    }
}


//
// 内联单元基类。
//
class InlineCell {
    //
}